---
kind: property
id: P:Autodesk.Revit.DB.Solid.Faces
source: html/b45fa881-3077-409c-0ef1-5d42744e7429.htm
---
# Autodesk.Revit.DB.Solid.Faces Property

The faces that belong to the solid.

## Syntax (C#)
```csharp
public FaceArray Faces { get; }
```

## Remarks
A face may be degenerate. This can be determined with the Face property IsTwoSided.